app/controllers/posts_controller.rb

UPDATE "posts" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_updated_at", "2016-04-04 10:56:57.407143"], ["image_file_name", "1.png"], ["updated_at", "2016-04-04 10:56:58.256757"], ["id", 7]]
---
    def update
        if @post.update post_params

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Вроцлав"], ["content", "Красивые фото очень красивого города."], ["created_at", "2016-03-26 21:04:53.203785"], ["updated_at", "2016-03-26 21:04:53.203785"]]
---
    def create
        @post = Post.new post_params
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_post
        @post = Post.find(params[:id])