app/controllers/welcome_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 3
---
    def index
        @posts = Post.all.limit(3).order("created_at desc")